XJU-Hurricane/STM32_Template/Full/f103/Drivers/bsp/Src/uart.c
/**
 * @file    uart.c
 * @author  Deadline039
 * @version 1.0
 * @date    2023-09-14
 * @note    STM32F103串口(usart1->uart5)的初始化函数以及中断服务函数
 *          如果启用了串口1,printf函数将会被重定义为从串口1输出
 *          如果使用串口DMA, 根据需要设置缓冲区大小, 在串口初始化的DMA
 *          Init函数中
 * @warning 要使用相关函数请预先在uart.h里打开宏定义
 *
 */

#include "uart.h"
#include "dma_uart.h"

/* 如果使用os,则包括下面的头文件即可. */
#if SYS_SUPPORT_OS
    #include "os.h" /* os 使用 */
#endif              /* SYS_SUPPORT_OS */

static uint8_t USART_TX_Buf[TX_BUF_LEN];

/*******************************************************************************
 * @defgroup 串口1
 * @{
 */

#ifdef EN_USART1
UART_HandleTypeDef USART1_Handler;
    #if EN_USART1_RX
        #if !USART1_USE_DMA_RX
uint8_t USART1_RX_BUF[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t USART1_RX_STA = 0;
uint8_t g_usart1_rx_buf[RXBUFFERSIZE];
        #endif /* !USART1_USE_DMA_RX */
/**
 * @brief 串口1中断服务函数
 */
void USART1_IRQHandler(void) {
        #if SYS_SUPPORT_OS /* 使用OS */
    OSIntEnter();
        #endif /* SYS_SUPPORT_OS */

        #if USART1_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&USART1_Handler, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&USART1_Handler);
        UART_DMARX_Idle_Callback(&USART1_Handler);
    }
        #endif /* USART1_USE_IDLE_IT */

    HAL_UART_IRQHandler(&USART1_Handler); /* 调用HAL库中断处理公用函数 */

        #if SYS_SUPPORT_OS /* 使用OS */
    OSIntExit();
        #endif /* SYS_SUPPORT_OS */
}
    #endif /* EN_USART1_RX */
/**
 * @brief 串口1初始化
 * @param bound 波特率
 */
void USART1_Init(uint32_t bound) {
    USART1_Handler.Instance = USART1;
    USART1_Handler.Init.BaudRate = bound;
    USART1_Handler.Init.WordLength = UART_WORDLENGTH_8B;
    USART1_Handler.Init.StopBits = UART_STOPBITS_1;
    USART1_Handler.Init.Parity = UART_PARITY_NONE;
    USART1_Handler.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    USART1_Handler.Init.Mode = UART_MODE_TX_RX;

    HAL_UART_Init(&USART1_Handler);

    #if USART1_USE_DMA_TX
    /* 打开DMA发送 */
    USART1_TX_DMA_Init(2048, 128);
    #endif /* USART1_USE_DMA_TX */

    #if EN_USART1_RX
        #if USART1_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    USART1_RX_DMA_Init(4096, 128);
        #else  /* USART1_USE_DMA_RX */
    HAL_UART_Receive_IT(&USART1_Handler, (uint8_t *)g_usart1_rx_buf,
                        RXBUFFERSIZE);
        #endif /* USART1_USE_DMA_RX */
    #endif     /* EN_USART1_RX */
}

#endif /* EN_USART1 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口2
 * @{
 */

#ifdef EN_USART2
UART_HandleTypeDef USART2_Handler;
    #if EN_USART2_RX
        #if !USART2_USE_DMA_RX
uint8_t USART2_RX_BUF[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t USART2_RX_STA = 0;
uint8_t g_usart2_rx_buf[RXBUFFERSIZE];
        #endif /* !USART2_USE_DMA_RX */
/**
 * @brief 串口2中断服务函数
 */
void USART2_IRQHandler(void) {
        #if SYS_SUPPORT_OS /* 使用OS */
    OSIntEnter();
        #endif /* SYS_SUPPORT_OS */

        #if USART2_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&USART2_Handler, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&USART2_Handler);
        UART_DMARX_Idle_Callback(&USART2_Handler);
    }
        #endif /* USART2_USE_IDLE_IT */

    HAL_UART_IRQHandler(&USART2_Handler); /* 调用HAL库中断处理公用函数 */

        #if SYS_SUPPORT_OS /* 使用OS */
    OSIntExit();
        #endif /* SYS_SUPPORT_OS */
}
    #endif /* EN_USART2_RX */
/**
 * @brief 串口2初始化
 * @param bound 波特率
 */
void USART2_Init(uint32_t bound) {
    USART2_Handler.Instance = USART2;
    USART2_Handler.Init.BaudRate = bound;
    USART2_Handler.Init.WordLength = UART_WORDLENGTH_8B;
    USART2_Handler.Init.StopBits = UART_STOPBITS_1;
    USART2_Handler.Init.Parity = UART_PARITY_NONE;
    USART2_Handler.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    USART2_Handler.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&USART2_Handler);

    #if USART2_USE_DMA_TX
    /* 打开DMA发送 */
    USART2_TX_DMA_Init(2048, 128);
    #endif /* USART2_USE_DMA_TX */

    #if EN_USART2_RX
        #if USART2_USE_DMA_RX
    /* 使用DMA, 打开DMA接收 */
    USART2_RX_DMA_Init(4096, 128);
        #else  /* USART2_USE_DMA_RX */
    HAL_UART_Receive_IT(&USART2_Handler, (uint8_t *)g_usart2_rx_buf,
                        RXBUFFERSIZE);
        #endif /* USART2_USE_DMA_RX */
    #endif     /* EN_USART2_RX */
}
#endif /* EN_USART2 */

/**
 * @}
 */

/*******************************************************************************
 * @defgroup 串口3
 * @{
 */

#ifdef EN_USART3
UART_HandleTypeDef USART3_Handler;
    #if EN_USART3_RX
        #if !USART3_USE_DMA_RX
uint8_t USART3_RX_BUF[USART_REC_LEN];
/**
 * 接收状态
 * bit15: 接收完成标志; bit14: 接收到0x0d
 * bit13~0: 接收到的有效字节数目
 */
uint16_t USART3_RX_STA = 0;
uint8_t g_usart3_rx_buf[RXBUFFERSIZE];
        #endif /* !USART3_USE_DMA_RX */
/**
 * @brief 串口3中断服务函数
 */
void USART3_IRQHandler(void) {
        #if SYS_SUPPORT_OS /* 使用OS */
    OSIntEnter();
        #endif /* SYS_SUPPORT_OS */

        #if USART3_USE_IDLE_IT
    if (__HAL_UART_GET_FLAG(&USART3_Handler, UART_FLAG_IDLE)) {
        __HAL_USART_CLEAR_IDLEFLAG(&USART3_Handler);
        UART_DMARX_Idle_Callback(&USART3_Handler);
    }
        #endif /* USART3_USE_IDLE_IT */

    HAL_UART_IRQHandler(&USART3_Handler); /* 调用HAL库中断处理公用函数 */

        #if SYS_SUPPORT_OS /* 使用OS */
    OSIntExit();
        #endif /* SYS_SUPPORT_OS */
}
    #endif /* EN_USART3_RX */
/**
 * @brief 串口3初始化
 * @param bound 波特率
 */
void USART3_Init(uint32_t bound) {
    USART3_Handler.Instance = USART3;
    USART3_Handler.Init.BaudRate = bound;
    USART3_Handler.Init.WordLength = UART_WORDLENGTH_8B;
    USART3_Handler.Init.StopBits = UART_STOPBITS_1;
    USART3_Handler.Init.Parity = UART_PARITY_NONE;
    USART3_Handler.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    USART3_Handler.Init.Mode = UART_MODE_TX_RX;
    HAL_UART_Init(&USART3_Handler);

    #if USART3_USE_DMA_TX
    /* 打开DMA发送 */
    USART3_TX_DMA_Init(2048, 128);
    #endif /* USART3_USE_DMA_TX */

